Test/result.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        Werkzeug/0.16.0
Server Hostname:        127.0.0.1
Server Port:            8001

Document Path:          /prime
Document Length:        4 bytes

Concurrency Level:      10
Time taken for tests:   1.370 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      157000 bytes
Total body sent:        161000
HTML transferred:       4000 bytes
Requests per second:    730.03 [#/sec] (mean)
Time per request:       13.698 [ms] (mean)
Time per request:       1.370 [ms] (mean, across all concurrent requests)
Transfer rate:          111.93 [Kbytes/sec] received
                        114.78 kb/s sent
                        226.71 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1   14   4.3     14      25
Waiting:        1   12   3.8     13      23
Total:          2   14   4.4     15      25

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     17
  75%     17
  80%     18
  90%     19
  95%     20
  98%     21
  99%     22
 100%     25 (longest request)